{"pageProps":{"courseData":{"href":"intropy","name":"Introduction to Python","difficulty":"Beginner","language":"Python","duration":"10 Weeks","signup_disabled":false,"signup":"https://forms.gle/zCveAia3tLh8uLfGA","tags":"","lessons":[{"title":"Introduction","description":"In this lesson, students will be introduced to the Python programming language, and learn how computers run code. Students will be able to write a simple program in Python.","short":"Introduction to programming and Python","href":"introduction","unavailable":[true,false,true],"date":"3/16/22"},{"title":"Variables","description":"Learn variables, a useful and important part of programming. You will learn how to define, manipulate, and use your variables. ","short":"Learn how to use variables in Python","href":"variables","unavailable":[true,false,true],"date":"3/23/22"},{"title":"Console I/O and String Manipulation","description":"Learn how to use the console, a way to input and output information with Python. You learn how to manipulate strings, one of the most important data types in Python.","short":"Learn how to use the console in Python","href":"consoleio","unavailable":[true,false,true],"date":"3/30/22"},{"title":"Basic Operations","description":"In this lesson, you will learn arithmetic operations. Arithmetic operations are used to do mathematical calculations and are used in almost every program. These can range from simple addition and subtraction to exponential calculations. We will look at how to perform such operations in Python, using functions and operators as needed.","short":"Learn how to use basic operations in Python","href":"arithmetic","unavailable":[true,false,true],"date":"4/06/22"},{"title":"Conditionals (If/Else)","description":"In this lesson, we will learn how to implement conditionals in Python. Conditionals are one of the most important control structures you will learn, and will help make your programs more interactive. You will learn how to write if-statements, boolean expressions, and logic operators.","short":"Learn about programming with branches","href":"conditionals","unavailable":[true,false,true],"date":"4/13/22"},{"title":"Control Structures (Loops)","description":"In this lesson, we will look at a second type of control structure: the loop. As you become more experienced in coding, you will see that most of your programs will include loops in some form. These can range from simple loops used for iterating through a range of numbers to complex nested loops used to work with complicated data. Throughout this lesson, you will learn about the numerous loop types that Python supports.","short":"Learn about looping in Python","href":"loops","unavailable":[true,false,true],"date":"4/20/22"},{"title":"Lists","description":"In this lesson, you will learn one of the most powerful and commonly used data types in Python, the list. Lists are used to store collections of data. You will learn how to define and manipulate lists.","short":"Learn about lists in Python","href":"lists","unavailable":[true,false,true],"date":"4/27/22"},{"title":"Functions","description":"You have learned many functions in past lessons. Now, you will learn how to write your own functions. In programming, functions are blocks of reusable code that are used to perform a certain as coded by a user.","short":"Learn how to write your own functions in Python","href":"functions","unavailable":[true,false,true],"date":"5/18/22"},{"title":"Debugging","description":"Now that you've learned the basics of Python, you will learn how to debug code and solve problems in your program. You will learn how to use resources on the internet and how to understand error messages. ","short":"Learn how to debug the code you write","href":"","unavailable":[true,true,true],"date":"5/25/22"},{"title":"Problem Solving","description":"This lesson introduces you to problem solving with Python, and how to translate a problem solving approach into code. ","short":"Learn how to solve problems with the knowledge you have","href":"","unavailable":[true,true,true],"date":"6/01/22"}],"hook":"Learn one the most popular programming languages","desc":["Our Introduction to Python course is designed to help teach students who are new to programming with one of the most popular languages. Python can be used for virtually anything and is well supported. Our course guides students through understanding how to program without any of the hassle that comes with figuring it out on our own.","The class will meet once weekly on Tuesdays. See each lesson below for information on particular dates. These sessions will include information, discussion, and time for students to create their own programs based on what they want."],"prerequisites":["Students will need a discord account as we will be communicating most of our important information through the platform. Our lessons will take place on discord.","Students will need internet access during our course because our lessons will be live. If they wish to verbally ask questions, they will need a working mic, though it is not a requirement since they can still type their questions."]}},"__N_SSG":true}