{"pageProps":{"info":{"name":"Applications of Python","hook":"Learn how to create data structures and algorithms in Python with ease","desc":["After learning the basics of Python, students can take this intermediate level course to enrich and develop their programming skills. This course traverses a wide range of topics, focusing particularly on creating data structures and algorithms with the object oriented programming paradigm. Students will also learn key libraries and modules in python to create applications of increasing complexity.","The class will meet once weekly on Thursdays. See each lesson below for information on particular dates. These sessions will include time for students to solve programming problems and learn essential programming skills."],"prerequisites":["Students who take this course should have taken an Introductory course in Python or similar. It is also recommended that they have taken at least an algebra level math course.","Students will need internet access during our course because our lessons will be live. If they wish to verbally ask questions, they will need a working mic, though it is not a requirement since they can still type their questions."],"signup_disabled":false,"signup":"https://forms.gle/vNX7LL3yK3uQaDjx5"},"lessons":[{"title":"Review from Intro to Python","description":"You will review basic concepts that are covered in an introductory course, to refresh your memory or to fill in gaps in your knowledge. You will use the concepts covered in this review in this course. ","short":"Review of introductory Python concepts","href":"review","unavailable":[true,false,true],"date":"3/17/22"},{"title":"Object-oriented Programming","description":"This lesson covers the basic idea and principles of object-oriented programming. You will learn concepts related to object-oriented programming, such as encapsulation, inheritance, abstraction, and polymorphism.","short":"Introduction to object-oriented programming","href":"","unavailable":[true,true,true],"date":"3/24/22"},{"title":"Defining a Class","description":"In this lesson, you will learn how to implement and write classes. You will be able to represent objects in the real world with classes and implement them with attributes and methods.","short":"Learn how to write your own classes","href":"","unavailable":[true,true,true],"date":"3/31/22"},{"title":"Inheritance and Polymorphism","description":"In this lesson, you will learn inheritance and polymorphism, and how they are implemented in the classes you will write. You learn how to use them to improve the code that you write.","short":"Learn how to implement inheritance and polymorphism","href":"","unavailable":[true,true,true],"date":"4/07/22"},{"title":"Algorithmic Thinking","description":"In this lesson, you will learn the implementation of common algorithms such as binary search. You will learn the process of developing an algorithm and Big O notation. ","short":"Learn the process of algorithmic thinking and improve your problem solving skills","href":"","unavailable":[true,true,true],"date":"4/14/22"},{"title":"Problem Day","description":"Students will use the knowledge they have learned to solve short problems with mentor guidance, to clear up confusions and strengthen up their knowledge.","short":"Practice the skills you have learned","href":"","unavailable":[true,true,true],"date":"4/21/22"},{"title":"Linked Lists and other data structures","description":"Students learn how to create a node class and learn how to create linked lists from the node list, like headers and append functions. Students also learn other important data structures and how to use them.","short":"Learn how to use different data structures and the benefits of using them","href":"","unavailable":[true,true,true],"date":"4/28/22"},{"title":"Function-function interactions","description":"Students will learn how functions can be used as parameters and decorators. They will learn how variable defined names can represent functions.","short":"Advance your knowledge of functions in python and how to expand their uses","href":"","unavailable":[true,true,true],"date":"5/19/22"}],"href":"applipy"},"__N_SSG":true}