{"pageProps":{"courses":{"courses":[{"href":"intropy","name":"Introduction to Python","difficulty":"Beginner","language":"Python","duration":"10 Weeks","signup_disabled":false,"signup":"https://forms.gle/zCveAia3tLh8uLfGA","tags":"","lessons":[{"title":"Introduction","description":"In this lesson, students will be introduced to the Python programming language, and learn how computers run code. Students will be able to write a simple program in Python.","short":"Introduction to programming and Python","href":"","unavailable":[true,false,true],"date":"3/15/22"},{"title":"Variables","description":"Learn variables, a useful and important part of programming. You will learn how to define, manipulate, and use your variables. ","short":"Learn how to use variables in Python","href":"","unavailable":[true,false,true],"date":"3/22/22"},{"title":"Console I/O and String Manipulation","description":"Learn how to use the console, a way to input and output information with Python. You learn how to manipulate strings, one of the most important data types in Python.","short":"Learn how to use the console in Python","href":"","unavailable":[true,false,true],"date":"3/29/22"},{"title":"Basic Operations","description":"In this lesson, you will learn arithmetic operations. Arithmetic operations are used to do mathematical calculations and are used in almost every program. These can range from simple addition and subtraction to exponential calculations. We will look at how to perform such operations in Python, using functions and operators as needed.","short":"Learn how to use basic operations in Python","href":"","unavailable":[true,false,true],"date":"4/05/22"},{"title":"Conditionals (If/Else)","description":"In this lesson, we will learn how to implement conditionals in Python. Conditionals are one of the most important control structures you will learn, and will help make your programs more interactive. You will learn how to write if-statements, boolean expressions, and logic operators.","short":"Learn about programming with branches","href":"","unavailable":[true,false,true],"date":"4/12/22"},{"title":"Control Structures (Loops)","description":"In this lesson, we will look at a second type of control structure: the loop. As you become more experienced in coding, you will see that most of your programs will include loops in some form. These can range from simple loops used for iterating through a range of numbers to complex nested loops used to work with complicated data. Throughout this lesson, you will learn about the numerous loop types that Python supports.","short":"Learn about looping in Python","href":"","unavailable":[true,false,true],"date":"4/19/22"},{"title":"Lists","description":"In this lesson, you will learn one of the most powerful and commonly used data types in Python, the list. Lists are used to store collections of data. You will learn how to define and manipulate lists.","short":"Learn about lists in Python","href":"","unavailable":[true,false,true],"date":"4/26/22"},{"title":"Functions","description":"You have learned many functions in past lessons. Now, you will learn how to write your own functions. In programming, functions are blocks of reusable code that are used to perform a certain as coded by a user.","short":"Learn how to write your own functions in Python","href":"","unavailable":[true,false,true],"date":"5/17/22"},{"title":"Debugging","description":"Now that you've learned the basics of Python, you will learn how to debug code and solve problems in your program. You will learn how to use resources on the internet and how to understand error messages. ","short":"Learn how to debug the code you write","href":"","unavailable":[true,true,true],"date":"5/24/22"},{"title":"Problem Solving","description":"This lesson introduces you to problem solving with Python, and how to translate a problem solving approach into code. ","short":"Learn how to solve problems with the knowledge you have","href":"","unavailable":[true,true,true],"date":"5/31/22"}],"hook":"Learn one the most popular programming languages","desc":["Our Introduction to Python course is designed to help teach students who are new to programming with one of the most popular languages. Python can be used for virtually anything and is well supported. Our course guides students through understanding how to program without any of the hassle that comes with figuring it out on our own.","The class will meet once weekly on Tuesdays. See each lesson below for information on particular dates. These sessions will include information, discussion, and time for students to create their own programs based on what they want."],"prerequisites":["Students will need a discord account as we will be communicating most of our important information through the platform. Our lessons will take place on discord.","Students will need internet access during our course because our lessons will be live. If they wish to verbally ask questions, they will need a working mic, though it is not a requirement since they can still type their questions."]},{"href":"introcpp","name":"Introduction to C++","difficulty":"Beginner","language":"C++","duration":"11 Weeks","signup_disabled":false,"signup":"https://forms.gle/oRPUgTsXvTuft4yK6","tags":"","lessons":[{"title":"Welcome to C++","description":"This lesson will consist of an introduction to the C++ language and explanations of how code is run and what happens within the computer. By the end, you will understand basic structure/syntax of C++ and you should be able to write a simple program.","short":"Introduction to the C++ language and its semantics","href":"introduction","unavailable":[false,false,false],"date":"3/14/22"},{"title":"Variables and Data Types","description":"In this lesson, we will look at variables, a useful and integral part of the of programs. We will learn how to define and use our own variables, and how we can manipulate the values stored within them. We will also learn how C++ handles variables of different data types.","short":"Explore how C++ stores information","href":"variables","unavailable":[true,true,true],"date":"3/21/22"},{"title":"Console I/O","description":"Sometimes, we may want to input information from the console a certain way or need a way to output information in a certain format. This lesson will go over all the intricacies of taking input and output from the console using C++.","short":"Understand the C++ console input and output","href":"","unavailable":[true,true,true],"date":"3/28/22"},{"title":"Arithmetic Operations","description":"In this lesson, we will look at arithmetic operations. Arithmetic operations are used to do mathematical calculations and are used in almost every program. These can range from simple addition and subtraction to exponential calculations. We will look at how to perform such operations in C++, using functions and operators as needed.","short":"Learn how to use arithmetic operations in C++","href":"","unavailable":[true,true,true],"date":"4/04/22"},{"title":"Conditionals","description":"In this lesson, we will learn how to implement conditionals in C++. Conditionals are one of the most important control structures you will learn, and will help make your programs more interactive. You will learn how to write if-statements, switch statements, boolean expressions, and logical operators.","short":"Incorporate decision making to programs","href":"","unavailable":[true,true,true],"date":"4/11/22"},{"title":"Looping","description":"In this lesson, we will look at a second type of control structure: the loop. As you become more experienced in coding, you will see that most of your programs will include repeated code. Loops allow for a way to reuse the same block of code in different ways. We will also learn how you can nest loops to create more complex programs. Throughout this lesson, you will learn about the numerous loop types that C++ supports.","short":"Learn to write less code and do more with loops","href":"","unavailable":[true,true,true],"date":"4/18/22"},{"title":"Arrays","description":"In this lesson, you will learn how to use arrays. You learn how to define and manipulate them, along with related libraries. Arrays are used to represent a collection of the same data type that belong together. By the end of the lesson, you will understand the uses and limitations of arrays in C++","short":"Arrays let you store more data in one variable","href":"","unavailable":[true,true,true],"date":"4/25/22"},{"title":"Functions","description":"You have learned many functions in past lessons. Now, you will learn how to write your own functions. In programming, functions are blocks of reusable code that are used to perform a certain as coded by a user.","short":"Organize and reuse code with functions","href":"","unavailable":[true,true,true],"date":"5/16/22"},{"title":"C++ Standard Library","description":"The C++ language comes with many powerful tools for writing programs. In this lesson we will go over some commonly used libraries in the C++ standard and explain how to read and understand documentation of them. These include <string>, <vector>, <algorithm>, and more.","short":"Explore new and powerful features of the C++ language","href":"","unavailable":[true,true,true],"date":"5/23/22"},{"title":"Debugging","description":"After writing many programs, you are bound to find some problems that you just don't know how to fix. This lesson goes over some of the techniques to find the bugs in your program and how to use the C++ debugger. It also includes a brief introduction to exceptions in C++.","short":"Find and squash the bugs in your program","href":"","unavailable":[true,true,true],"date":"5/30/22"},{"title":"Problem Solving","description":"This lesson goes over how to think about solving programming challenges and translating what you want to do into code. The final lesson of our Introduction to C++ course will make sure you have all the tools needed for you to start projects of your own.","short":"Prepare to jump off on your own C++ adventure","href":"","unavailable":[true,true,true],"date":"6/06/22"}],"hook":"Learn one of the world's most powerful programming languages","desc":["Begin your journey into the world of C++, a popular and powerful languages used for various applications including game development, virtual reality, and robotics. C++ allows students to learn and understand the intricacies of the computer while still controlling it all from a high level environment. The course explores everything needed for students to build their own console applications and more.","The class will meet once weekly on Mondays. See each lesson below for information on particular dates. These sessions will give students the instruction and time to create C++ programs."],"prerequisites":["Students will need a discord account as we will be communicating most of our important information through the platform. Our lessons will take place on discord.","Students will need internet access during our course because our lessons will be live. If they wish to verbally ask questions, they will need a working mic, though it is not a requirement since they can still type their questions."]},{"href":"applipy","name":"Applications of Python","difficulty":"Moderate","language":"Python","duration":"8 Weeks","signup_disabled":false,"signup":"https://forms.gle/vNX7LL3yK3uQaDjx5","tags":"","lessons":[{"title":"Review from Intro to Python","description":"You will review basic concepts that are covered in an introductory course, to refresh your memory or to fill in gaps in your knowledge. You will use the concepts covered in this review in this course. ","short":"Review of introductory Python concepts","href":"","unavailable":[true,false,true],"date":"3/16/22"},{"title":"Object-oriented Programming","description":"This lesson covers the basic idea and principles of object-oriented programming. You will learn concepts related to object-oriented programming, such as encapsulation, inheritance, abstraction, and polymorphism.","short":"Introduction to object-oriented programming","href":"","unavailable":[true,true,true],"date":"3/23/22"},{"title":"Defining a Class","description":"In this lesson, you will learn how to implement and write classes. You will be able to represent objects in the real world with classes and implement them with attributes and methods.","short":"Learn how to write your own classes","href":"","unavailable":[true,true,true],"date":"3/30/22"},{"title":"Inheritance and Polymorphism","description":"In this lesson, you will learn inheritance and polymorphism, and how they are implemented in the classes you will write. You learn how to use them to improve the code that you write.","short":"Learn how to implement inheritance and polymorphism","href":"","unavailable":[true,true,true],"date":"4/06/22"},{"title":"Algorithmic Thinking","description":"In this lesson, you will learn the implementation of common algorithms such as binary search. You will learn the process of developing an algorithm and Big O notation. ","short":"Learn the process of algorithmic thinking and improve your problem solving skills","href":"","unavailable":[true,true,true],"date":"4/13/22"},{"title":"Problem Day","description":"Students will use the knowledge they have learned to solve short problems with mentor guidance, to clear up confusions and strengthen up their knowledge.","short":"Practice the skills you have learned","href":"","unavailable":[true,true,true],"date":"4/20/22"},{"title":"Linked Lists and other data structures","description":"Students learn how to create a node class and learn how to create linked lists from the node list, like headers and append functions. Students also learn other important data structures and how to use them.","short":"Learn how to use different data structures and the benefits of using them","href":"","unavailable":[true,true,true],"date":"4/27/22"},{"title":"Function-function interactions","description":"Students will learn how functions can be used as parameters and decorators. They will learn how variable defined names can represent functions.","short":"Advance your knowledge of functions in python and how to expand their uses","href":"","unavailable":[true,true,true],"date":"5/18/22"}],"hook":"Learn how to create data structures and algorithms in Python with ease","desc":["After learning the basics of Python, students can take this intermediate level course to enrich and develop their programming skills. This course traverses a wide range of topics, focusing particularly on creating data structures and algorithms with the object oriented programming paradigm. Students will also learn key libraries and modules in python to create applications of increasing complexity.","The class will meet once weekly on Wednesday. See each lesson below for information on particular dates. These sessions will include time for students to solve programming problems and learn essential programming skills."],"prerequisites":["Students who take this course should have taken an Introductory course in Python or similar. It is also recommended that they have taken at least an algebra level math course.","Students will need internet access during our course because our lessons will be live. If they wish to verbally ask questions, they will need a working mic, though it is not a requirement since they can still type their questions."]}]}},"__N_SSG":true}